Revit 2027 API
RebarConstraint.GetTargetRebarBendNumber Method
 Gets the number of the bend on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'BarBend'. Rebar must be Shape Driven Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetTargetRebarBendNumber()
Public Function GetTargetRebarBendNumber As Integer
public:
int GetTargetRebarBendNumber()
member GetTargetRebarBendNumber : unit -> int
Return Value
Int32
 Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The TargetRebarConstraintType is not 'BarBend' -or- Constrained rebar isn't a Shape Driven Rebar element.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace